#1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
def calc_divide (a, b):
    ''''эта фунция делит 2 числа а - делимое, b - делитель
    предусмотрена проверка деления на ноль и на корректность введения данных'''
    try:
        a, b = int(a),int(b)
        c_div = a/b
    except ZeroDivisionError:
        return 'нельзя делить на ноль'
    except ValueError:
        return 'введите корректные данные, только числа'
    return c_div
print(calc_divide(input('введите делимое - '), input('введите делитель - ')))

