#2. Реализовать функцию, принимающую несколько параметров, описывающих данные
# пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы. Реализовать вывод
# данных о пользователе одной строкой.
def my_phone_book(**kwargs):
    '''выдает в виде строки принятые данные. Данные пердаются в виде словаря'''
    return ' '.join(kwargs.values())
fields = (('name', 'Имя-'), ('surname', 'Фамилия-'), ('year_birth', 'Год рождения-'), ('city', 'Город-'), ('email', 'Е-майл-'), ('phone_num','Телефон-')) # поля словаря
pers = {}
for field in fields:
    pers[field[0]] = input(f'Заполните поле {field[1]}')
print(my_phone_book(**pers))