#3. Реализовать функцию my_func(), которая принимает три позиционных аргумента,
# и возвращает сумму наибольших двух аргументов.

def my_func(num_1, num_2, num_3):
    '''функия принимает 3 значения, выдает сумму наибольших путем исключения наименьшего числа'''
    my_list = [num_1, num_2, num_3]
    my_list.remove(min(my_list))
    return sum(my_list)
print(my_func(int(input("введите значение -")), int(input("введите значение -")), int(input("введите значение -"))))
